ODENet(
  (net): Sequential(
    (linear_1): Linear(in_features=350, out_features=20, bias=True)
    (activation_1): Sigmoid()
    (linear_2): Linear(in_features=20, out_features=350, bias=True)
  )
)