ODENet(
  (net_prods): Sequential(
    (activation_0): SoftsignMod()
    (linear_1): Linear(in_features=350, out_features=75, bias=True)
    (activation_1): SoftsignMod()
    (linear_2): Linear(in_features=75, out_features=75, bias=True)
    (activation_2): PseudoSquare()
    (linear_out): Linear(in_features=75, out_features=350, bias=True)
  )
)


    def forward(self, t, y):
        prods = self.net_prods(y)
        final = torch.relu(self.gene_multipliers)*(prods  - y) 
        return(final) 
