ODENet(
  (net_sums): Sequential(
    (activation_0): SoftsignMod()
    (linear_out): Linear(in_features=1135, out_features=40, bias=True)
  )
  (net_alpha_combine): Sequential(
    (linear_out): Linear(in_features=40, out_features=1135, bias=False)
  )
)


    def forward(self, t, y):
        sums = self.net_sums(y)
        joint = self.net_alpha_combine(sums)
        carry_cap = torch.sigmoid(joint)
        final =  y * (0.75 - torch.sigmoid(y/carry_cap))  
        return(final) 
