ODENet(
  (net_sums): Sequential(
    (activation_0): Sigmoid()
    (linear_out): Linear(in_features=1135, out_features=100, bias=True)
  )
  (net_alpha_combine): Sequential(
    (linear_out): Linear(in_features=100, out_features=1135, bias=False)
  )
)


    def forward(self, t, y):
        sums = self.net_sums(y)
        joint = self.net_alpha_combine(sums)
        final = torch.relu(self.gene_multipliers)*(joint) 
        return(final) 
