ODENet(
  (net_prods): Sequential(
    (activation_0): SoftsignMod()
    (activation_1): PseudoSquare()
    (linear_out): Linear(in_features=350, out_features=350, bias=False)
  )
  (net_sums): Sequential(
    (activation_0): SoftsignMod()
    (linear_out): Linear(in_features=350, out_features=350, bias=False)
  )
)


    def forward(self, t, y):
        sums = self.net_sums(y)
        prods_part = torch.pow(sums, exponent = 2) - self.net_prods(y)
        alpha = torch.sigmoid(self.model_weights)
        joint =  (1-alpha)*prods_part + alpha*sums
        final = torch.relu(self.gene_multipliers)*(joint  - y) 
        return(final) 
