ODENet(
  (net_sums): Sequential(
    (activation_0): SoftsignMod()
    (linear_out): Linear(in_features=1135, out_features=120, bias=True)
  )
  (net_alpha_combine): Sequential(
    (linear_out): Linear(in_features=120, out_features=1135, bias=False)
  )
)