ODENet(
  (net_ootb): Sequential(
    (activation_0): Sigmoid()
    (linear_1): Linear(in_features=350, out_features=80, bias=True)
    (activation_1): Sigmoid()
    (linear_out): Linear(in_features=80, out_features=350, bias=True)
  )
)


    def forward(self, t, y):
        res = self.net_ootb(y)
        final = res - y
        return(final) 
