ODENet(
  (net): Sequential(
    (0): Linear(in_features=350, out_features=20, bias=True)
    (1): LayerNorm((20,), eps=1e-05, elementwise_affine=False)
    (2): Sigmoid()
    (3): Linear(in_features=20, out_features=20, bias=True)
    (4): LayerNorm((20,), eps=1e-05, elementwise_affine=False)
    (5): Tanh()
    (6): Linear(in_features=20, out_features=350, bias=True)
  )
)