ODENet(
  (net): Sequential(
    (0): Linear(in_features=350, out_features=350, bias=True)
    (1): LogSigmoid()
    (2): Linear(in_features=350, out_features=350, bias=True)
    (3): LogSigmoid()
    (4): Linear(in_features=350, out_features=350, bias=True)
    (5): LogSigmoid()
    (6): Linear(in_features=350, out_features=350, bias=True)
    (7): LogSigmoid()
    (8): Linear(in_features=350, out_features=350, bias=True)
    (9): LogSigmoid()
    (10): Linear(in_features=350, out_features=350, bias=True)
    (11): LogSigmoid()
    (12): Linear(in_features=350, out_features=350, bias=True)
    (13): LogSigmoid()
    (14): Linear(in_features=350, out_features=350, bias=True)
    (15): Tanh()
    (16): Linear(in_features=350, out_features=350, bias=True)
  )
)