ODENet(
  (net): Sequential(
    (0): Linear(in_features=350, out_features=350, bias=True)
    (1): LayerNorm((350,), eps=1e-05, elementwise_affine=False)
    (2): Sigmoid()
    (3): Linear(in_features=350, out_features=350, bias=True)
    (4): LayerNorm((350,), eps=1e-05, elementwise_affine=False)
    (5): Sigmoid()
    (6): Linear(in_features=350, out_features=350, bias=True)
    (7): LayerNorm((350,), eps=1e-05, elementwise_affine=False)
    (8): Sigmoid()
    (9): Linear(in_features=350, out_features=350, bias=True)
    (10): LayerNorm((350,), eps=1e-05, elementwise_affine=False)
    (11): Tanh()
    (12): Linear(in_features=350, out_features=350, bias=True)
  )
)