ODENet(
  (net): Sequential(
    (0): Linear(in_features=150, out_features=750, bias=True)
    (1): Tanh()
    (2): Linear(in_features=750, out_features=750, bias=True)
    (3): Tanh()
    (4): Linear(in_features=750, out_features=750, bias=True)
    (5): Tanh()
    (6): Linear(in_features=750, out_features=150, bias=True)
  )
)