ODENet(
  (net): Sequential(
    (linear_0): Linear(in_features=350, out_features=2000, bias=True)
    (activation_0): Tanh()
    (linear_1): Linear(in_features=2000, out_features=2000, bias=True)
    (activation_1): Tanh()
    (linear_2): Linear(in_features=2000, out_features=350, bias=True)
  )
)