ODENet(
  (net): Sequential(
    (0): Linear(in_features=150, out_features=500, bias=True)
    (1): Sigmoid()
    (2): Linear(in_features=500, out_features=500, bias=True)
    (3): Sigmoid()
    (4): Linear(in_features=500, out_features=500, bias=True)
    (5): Sigmoid()
    (6): Linear(in_features=500, out_features=150, bias=True)
  )
)