ODENet(
  (net_prods): Sequential(
    (activation_0): LogShiftedSoftSignMod()
    (linear_out): Linear(in_features=70, out_features=5, bias=True)
  )
  (net_sums): Sequential(
    (activation_0): SoftsignMod()
    (linear_out): Linear(in_features=70, out_features=5, bias=True)
  )
  (net_alpha_combine): Sequential(
    (linear_out): Linear(in_features=10, out_features=70, bias=False)
  )
)


    def forward(self, t, y):
        sums = self.net_sums(y)
        prods = torch.exp(self.net_prods(y))
        sums_prods_concat = torch.cat((sums, prods), dim= - 1)
        joint = self.net_alpha_combine(sums_prods_concat)
        final = torch.relu(self.gene_multipliers)*(joint - torch.sigmoid(self.minus_effect_factor) * y ) #joint  - y 
        return(final) 
