ODENet(
  (net_prods): Sequential(
    (activation_0): LogShiftedSoftSignMod()
    (linear_out): Linear(in_features=350, out_features=350, bias=True)
  )
)


    def forward(self, t, y):
        prods = self.net_prods(y)
        final = torch.relu(self.gene_multipliers)*(torch.exp(prods)  - y) 
        return(final) 
