ODENet(
  (net): Sequential(
    (0): Linear(in_features=30, out_features=200, bias=True)
    (1): LeakyReLU(negative_slope=0.01)
    (2): Linear(in_features=200, out_features=200, bias=True)
    (3): LeakyReLU(negative_slope=0.01)
    (4): Linear(in_features=200, out_features=200, bias=True)
    (5): LeakyReLU(negative_slope=0.01)
    (6): Linear(in_features=200, out_features=200, bias=True)
    (7): LeakyReLU(negative_slope=0.01)
    (8): Linear(in_features=200, out_features=200, bias=True)
    (9): LeakyReLU(negative_slope=0.01)
    (10): Linear(in_features=200, out_features=200, bias=True)
    (11): LeakyReLU(negative_slope=0.01)
    (12): Linear(in_features=200, out_features=200, bias=True)
    (13): LeakyReLU(negative_slope=0.01)
    (14): Linear(in_features=200, out_features=30, bias=True)
  )
)