ODENet(
  (net): Sequential(
    (linear_0): Linear(in_features=350, out_features=75, bias=True)
    (activation_0): Expo()
    (linear_1): Linear(in_features=75, out_features=75, bias=True)
    (activation_1): Tanh()
    (linear_2): Linear(in_features=75, out_features=350, bias=True)
  )
)