ODENet(
  (net_prods): Sequential(
    (activation_0): LogShiftedSoftSignMod()
    (linear_out): Linear(in_features=690, out_features=50, bias=True)
  )
  (net_sums): Sequential(
    (activation_0): SoftsignMod()
    (linear_out): Linear(in_features=690, out_features=50, bias=True)
  )
  (net_alpha_combine): Sequential(
    (linear_out): Linear(in_features=100, out_features=690, bias=False)
  )
)