ODENet(
  (net_sums): Sequential(
    (activation_0): Softsign()
    (linear_1): Linear(in_features=690, out_features=150, bias=True)
    (activation_1): Softsign()
    (linear_out): Linear(in_features=150, out_features=690, bias=True)
  )
)


    def forward(self, t, y):
        sums = self.net_sums(y)
        final = torch.relu(self.gene_multipliers)*(sums  - y) 
        return(final) 
