ODENet(
  (net): Sequential(
    (activation_0): Softsign()
    (linear_1): Linear(in_features=350, out_features=75, bias=True)
    (activation_1): Softsign()
    (linear_out): Linear(in_features=75, out_features=350, bias=True)
  )
  (net2): Sequential(
    (linear_out): Linear(in_features=350, out_features=350, bias=True)
    (activation_0): Sigmoid()
  )
)


    def forward(self, t, y):
        grad1 = self.net(y)
        grad2 = self.net2(y)
        final = grad2*(grad1 - y)     
        return(final) 
