ODENet(
  (net): Sequential(
    (0): Linear(in_features=350, out_features=350, bias=True)
    (1): Sigmoid()
    (2): Linear(in_features=350, out_features=350, bias=True)
    (3): Softplus(beta=1, threshold=20)
    (4): Linear(in_features=350, out_features=350, bias=True)
    (5): Expo()
    (6): Linear(in_features=350, out_features=350, bias=True)
  )
)