ODENet(
  (net): Sequential(
    (0): LogX()
    (1): Linear(in_features=350, out_features=100, bias=True)
    (2): LayerNorm((100,), eps=1e-05, elementwise_affine=False)
    (3): Softplus(beta=1, threshold=20)
    (4): Linear(in_features=100, out_features=100, bias=True)
    (5): LayerNorm((100,), eps=1e-05, elementwise_affine=False)
    (6): Expo()
    (7): Linear(in_features=100, out_features=350, bias=True)
  )
)