ODENet(
  (net): Sequential(
    (0): Linear(in_features=350, out_features=500, bias=True)
    (1): Tanh()
    (2): Linear(in_features=500, out_features=500, bias=True)
    (3): Tanh()
    (4): Linear(in_features=500, out_features=500, bias=True)
    (5): Tanh()
    (6): Linear(in_features=500, out_features=500, bias=True)
    (7): Tanh()
    (8): Linear(in_features=500, out_features=500, bias=True)
    (9): Tanh()
    (10): Linear(in_features=500, out_features=500, bias=True)
    (11): Tanh()
    (12): Linear(in_features=500, out_features=500, bias=True)
    (13): Tanh()
    (14): Linear(in_features=500, out_features=500, bias=True)
    (15): Tanh()
    (16): Linear(in_features=500, out_features=500, bias=True)
    (17): Linear(in_features=500, out_features=350, bias=True)
  )
)