ODENet(
  (net): Sequential(
    (0): Tanh()
    (1): Linear(in_features=350, out_features=350, bias=True)
    (2): Softplus(beta=1, threshold=20)
    (3): Linear(in_features=350, out_features=350, bias=True)
    (4): Softplus(beta=1, threshold=20)
    (5): Linear(in_features=350, out_features=350, bias=True)
    (6): Softplus(beta=1, threshold=20)
    (7): Linear(in_features=350, out_features=350, bias=True)
    (8): Softplus(beta=1, threshold=20)
    (9): Linear(in_features=350, out_features=350, bias=True)
    (10): Softplus(beta=1, threshold=20)
    (11): Linear(in_features=350, out_features=350, bias=True)
    (12): Sigmoid()
    (13): Linear(in_features=350, out_features=350, bias=True)
    (14): Sigmoid()
    (15): Linear(in_features=350, out_features=350, bias=True)
    (16): Tanh()
    (17): Linear(in_features=350, out_features=350, bias=True)
  )
)