ODENet(
  (net): Sequential(
    (0): Linear(in_features=690, out_features=80, bias=True)
    (1): LayerNorm((80,), eps=1e-05, elementwise_affine=False)
    (2): Sigmoid()
    (3): Linear(in_features=80, out_features=80, bias=True)
    (4): LayerNorm((80,), eps=1e-05, elementwise_affine=False)
    (5): Tanh()
    (6): Linear(in_features=80, out_features=690, bias=True)
  )
)