ODENet(
  (net_sums): Sequential(
    (activation_0): SoftsignMod()
    (linear_out): Linear(in_features=1135, out_features=50, bias=True)
  )
  (net_alpha_combine): Sequential(
    (linear_out): Linear(in_features=50, out_features=1135, bias=False)
  )
)


    def forward(self, t, y):
        sums = self.net_sums(y)
        joint = self.net_alpha_combine(sums)
        final = joint
        return(final) 
