ODENet(
  (net): Sequential(
    (0): Linear(in_features=350, out_features=300, bias=True)
    (1): Sigmoid()
    (2): Linear(in_features=300, out_features=300, bias=True)
    (3): Sigmoid()
    (4): Linear(in_features=300, out_features=300, bias=True)
    (5): Sigmoid()
    (6): Linear(in_features=300, out_features=300, bias=True)
    (7): Sigmoid()
    (8): Linear(in_features=300, out_features=300, bias=True)
    (9): Sigmoid()
    (10): Linear(in_features=300, out_features=300, bias=True)
    (11): Sigmoid()
    (12): Linear(in_features=300, out_features=300, bias=True)
    (13): Sigmoid()
    (14): Linear(in_features=300, out_features=300, bias=True)
    (15): Sigmoid()
    (16): Linear(in_features=300, out_features=300, bias=True)
    (17): Sigmoid()
    (18): Linear(in_features=300, out_features=300, bias=True)
    (19): Tanh()
    (20): Linear(in_features=300, out_features=350, bias=True)
  )
)