ODENet(
  (net_prods): Sequential(
    (activation_0): LogShiftedSoftSignMod()
    (linear_out): Linear(in_features=384, out_features=40, bias=True)
  )
  (net_sums): Sequential(
    (activation_0): SoftsignMod()
    (linear_out): Linear(in_features=384, out_features=40, bias=True)
  )
  (net_alpha_combine): Sequential(
    (linear_out): Linear(in_features=80, out_features=384, bias=False)
  )
)