ODENet(
  (net): Sequential(
    (0): Linear(in_features=350, out_features=350, bias=True)
    (1): Softplus(beta=1, threshold=20)
    (2): Linear(in_features=350, out_features=350, bias=True)
    (3): Softplus(beta=1, threshold=20)
    (4): Linear(in_features=350, out_features=350, bias=True)
    (5): Softplus(beta=1, threshold=20)
    (6): Linear(in_features=350, out_features=350, bias=True)
    (7): Softplus(beta=1, threshold=20)
    (8): Linear(in_features=350, out_features=350, bias=True)
    (9): Softplus(beta=1, threshold=20)
    (10): Linear(in_features=350, out_features=350, bias=True)
    (11): Sigmoid()
    (12): Linear(in_features=350, out_features=350, bias=True)
    (13): Sigmoid()
    (14): Linear(in_features=350, out_features=350, bias=True)
    (15): Tanh()
    (16): Linear(in_features=350, out_features=350, bias=True)
  )
)